{
  "architectures": [
    "SPAREQwen2_5_VLForConditionalGeneration"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "eos_token_id": 151645,
  "hidden_act": "silu",
  "hidden_size": 3584,
  "image_token_id": 151655,
  "initializer_range": 0.02,
  "intermediate_size": 18944,
  "max_position_embeddings": 128000,
  "max_window_layers": 28,
  "model_type": "spare_qwen2_5_vl",
  "num_attention_heads": 28,
  "num_hidden_layers": 28,
  "num_key_value_heads": 4,
  "rms_norm_eps": 1e-06,
  "rope_scaling": {
    "mrope_section": [
      16,
      24,
      24
    ],
    "rope_type": "default",
    "type": "default"
  },
  "rope_theta": 1000000.0,
  "sliding_window": 32768,
  "spare_config": {
    "compressor": {
      "enable": true,
      "prune_depth": [],
      "prune_depth_ratio": [],
      "prune_layers": [
        7,
        14,
        21
      ]
    },
    "evaluate": false,
    "freeze_embeddings": true,
    "freeze_llm": true,
    "freeze_vision_encoder": true,
    "loss_config": {
      "lambda_compact": 0.01,
      "lambda_distortion": 0.01,
      "lambda_kd_feature": 0.5,
      "lambda_kd_logits": 0.5,
      "lambda_rate": 0.4,
      "lambda_tv": 0.01,
      "temperature_kd_feature": 2.0,
      "temperature_kd_logits": 2.0
    },
    "use_gradient_checkpointing": false
  },
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.51.3",
  "use_cache": true,
  "use_sliding_window": false,
  "video_token_id": 151656,
  "vision_config": {
    "_attn_implementation_autoset": true,
    "depth": 32,
    "fullatt_block_indexes": [
      7,
      15,
      23,
      31
    ],
    "hidden_act": "silu",
    "hidden_size": 1280,
    "in_channels": 3,
    "in_chans": 3,
    "intermediate_size": 3420,
    "model_type": "qwen2_5_vl",
    "num_heads": 16,
    "out_hidden_size": 3584,
    "patch_size": 14,
    "spatial_merge_size": 2,
    "spatial_patch_size": 14,
    "temporal_patch_size": 2,
    "tokens_per_second": 2,
    "torch_dtype": "bfloat16",
    "window_size": 112
  },
  "vision_end_token_id": 151653,
  "vision_start_token_id": 151652,
  "vision_token_id": 151654,
  "vocab_size": 152064
}
